; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v10 ?v11)
             (pred_7 ?v4 ?v7)
             (pred_2 ?v10 ?v7)
             (pred_9 ?v12 ?v10 )
	     (pred_4 ?v10)
             (pred_10 ?v13)
             (pred_5 ?v4)
             (pred_8 ?v7)
             (pred_11 ?v10)
             (pred_1 ?v4)
             (pred_12 ?v10)
             (pred_6 ))



(:action op_3
:parameters (?v6 ?v3 ?v5 ?v9)
:precondition (and (pred_10 ?v6) (pred_10 ?v3) (pred_5 ?v5) (pred_8 ?v9)
          (pred_3 ?v6 ?v3) (pred_7 ?v5 ?v9)
                   (pred_2 ?v3 ?v9) (pred_4 ?v6) 
                   (pred_11 ?v3) (pred_1 ?v5))
:effect (and  (pred_12 ?v3) (not (pred_11 ?v3))))


(:action op_5
:parameters (?v6 ?v8)
:precondition (and (pred_10 ?v6) (pred_10 ?v8)
               (pred_4 ?v6) (pred_3 ?v6 ?v8) (pred_12 ?v8))
:effect (and (pred_4 ?v8) (not (pred_4 ?v6))))

(:action op_4
:parameters (?v6 ?v5)
:precondition (and (pred_10 ?v6) (pred_5 ?v5) 
                  (pred_4 ?v6) (pred_9 ?v5 ?v6) (pred_6 ))
:effect (and (pred_1 ?v5)
   (not (pred_9 ?v5 ?v6)) (not (pred_6 ))))


(:action op_1
:parameters (?v6 ?v1 ?v2)
:precondition (and (pred_10 ?v6) (pred_5 ?v1) (pred_5 ?v2)
                  (pred_4 ?v6) (pred_1 ?v2) (pred_9 ?v1 ?v6))
:effect (and (pred_1 ?v1) (pred_9 ?v2 ?v6)
        (not (pred_1 ?v2)) (not (pred_9 ?v1 ?v6))))

(:action op_2
:parameters (?v6 ?v5)
:precondition (and (pred_10 ?v6) (pred_5 ?v5) 
                  (pred_4 ?v6) (pred_1 ?v5))
:effect (and (pred_6 ) (pred_9 ?v5 ?v6) (not (pred_1 ?v5)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_02 obj_15 obj_07 obj_14 obj_19 obj_16 obj_11 obj_17 obj_01 obj_10 obj_22 obj_09 obj_21 obj_13 obj_18 obj_20
    obj_04 obj_08 obj_05
    obj_03 obj_06 obj_12
    )

    (:init
       (pred_6)

       (pred_10 obj_02)
       (pred_10 obj_15)
       (pred_10 obj_07)
       (pred_10 obj_14)
       (pred_10 obj_19)
       (pred_10 obj_16)
       (pred_10 obj_11)
       (pred_10 obj_17)
       (pred_10 obj_01)
       (pred_10 obj_10)
       (pred_10 obj_22)
       (pred_10 obj_09)
       (pred_10 obj_21)
       (pred_10 obj_13)
       (pred_10 obj_18)
       (pred_10 obj_20)
       (pred_8 obj_04)
       (pred_8 obj_08)
       (pred_8 obj_05)
       (pred_5 obj_03)
       (pred_5 obj_06)
       (pred_5 obj_12)

       (pred_3 obj_02 obj_19)
       (pred_3 obj_02 obj_15)
       (pred_3 obj_15 obj_16)
       (pred_3 obj_15 obj_07)
       (pred_3 obj_15 obj_02)
       (pred_3 obj_07 obj_11)
       (pred_3 obj_07 obj_14)
       (pred_3 obj_07 obj_15)
       (pred_3 obj_14 obj_17)
       (pred_3 obj_14 obj_07)
       (pred_3 obj_19 obj_01)
       (pred_3 obj_19 obj_16)
       (pred_3 obj_19 obj_02)
       (pred_3 obj_16 obj_10)
       (pred_3 obj_16 obj_11)
       (pred_3 obj_16 obj_15)
       (pred_3 obj_16 obj_19)
       (pred_3 obj_11 obj_22)
       (pred_3 obj_11 obj_17)
       (pred_3 obj_11 obj_07)
       (pred_3 obj_11 obj_16)
       (pred_3 obj_17 obj_09)
       (pred_3 obj_17 obj_14)
       (pred_3 obj_17 obj_11)
       (pred_3 obj_01 obj_21)
       (pred_3 obj_01 obj_10)
       (pred_3 obj_01 obj_19)
       (pred_3 obj_10 obj_13)
       (pred_3 obj_10 obj_22)
       (pred_3 obj_10 obj_16)
       (pred_3 obj_10 obj_01)
       (pred_3 obj_22 obj_18)
       (pred_3 obj_22 obj_09)
       (pred_3 obj_22 obj_11)
       (pred_3 obj_22 obj_10)
       (pred_3 obj_09 obj_20)
       (pred_3 obj_09 obj_17)
       (pred_3 obj_09 obj_22)
       (pred_3 obj_21 obj_13)
       (pred_3 obj_21 obj_01)
       (pred_3 obj_13 obj_18)
       (pred_3 obj_13 obj_10)
       (pred_3 obj_13 obj_21)
       (pred_3 obj_18 obj_20)
       (pred_3 obj_18 obj_22)
       (pred_3 obj_18 obj_13)
       (pred_3 obj_20 obj_09)
       (pred_3 obj_20 obj_18)
       (pred_11 obj_01)
       (pred_11 obj_13)
       (pred_11 obj_11)
       (pred_2  obj_01 obj_04)
       (pred_2  obj_13 obj_08)
       (pred_2  obj_11 obj_05)
       (pred_12 obj_02)
       (pred_12 obj_15)
       (pred_12 obj_07)
       (pred_12 obj_14)
       (pred_12 obj_19)
       (pred_12 obj_16)
       (pred_12 obj_17)
       (pred_12 obj_10)
       (pred_12 obj_22)
       (pred_12 obj_09)
       (pred_12 obj_21)
       (pred_12 obj_18)
       (pred_12 obj_20)

       (pred_7  obj_03 obj_04)
       (pred_7  obj_06 obj_08)
       (pred_7  obj_12 obj_05)
       (pred_9 obj_03 obj_17)
       (pred_9 obj_06 obj_18)
       (pred_9 obj_12 obj_19)
       (pred_4 obj_19)
    )

    (:goal (and
       (pred_9 obj_06 obj_20)
    ))
(:constraints
  (always (not (pred_4 obj_22)))
)
)

; plan
1. (op_4 obj_19 obj_12)
   deleted: (pred_9 obj_12 obj_19) (pred_6)
   added: (pred_1 obj_12)
   goals met: 0 of 1
2. (op_5 obj_19 obj_16)
   deleted: (pred_4 obj_19)
   added: (pred_4 obj_16)
   goals met: 0 of 1
3. (op_3 obj_16 obj_11 obj_12 obj_05)
   deleted: (pred_11 obj_11)
   added: (pred_12 obj_11)
   goals met: 0 of 1
4. (op_2 obj_16 obj_12)
   deleted: (pred_1 obj_12)
   added: (pred_6) (pred_9 obj_12 obj_16)
   goals met: 0 of 1
5. (op_5 obj_16 obj_11)
   deleted: (pred_4 obj_16)
   added: (pred_4 obj_11)
   goals met: 0 of 1
6. (op_5 obj_11 obj_17)
   deleted: (pred_4 obj_11)
   added: (pred_4 obj_17)
   goals met: 0 of 1
7. (op_5 obj_17 obj_09)
   deleted: (pred_4 obj_17)
   added: (pred_4 obj_09)
   goals met: 0 of 1
8. (op_5 obj_09 obj_20)
   deleted: (pred_4 obj_09)
   added: (pred_4 obj_20)
   goals met: 0 of 1
9. (op_5 obj_20 obj_18)
   deleted: (pred_4 obj_20)
   added: (pred_4 obj_18)
   goals met: 0 of 1
10. (op_4 obj_18 obj_06)
   deleted: (pred_9 obj_06 obj_18) (pred_6)
   added: (pred_1 obj_06)
   goals met: 0 of 1
11. (op_5 obj_18 obj_20)
   deleted: (pred_4 obj_18)
   added: (pred_4 obj_20)
   goals met: 0 of 1
12. (op_2 obj_20 obj_06)
   deleted: (pred_1 obj_06)
   added: (pred_6) (pred_9 obj_06 obj_20)
   goals met: 1 of 1
